name = input("Ты просыпаешься в темной пещере.\n"
             "Навстречу, из темноты, приближается темный силуэт.\n"
             "Фигура в плаще с капюшоном, закрывающим лицо, спрашивает:\n"
             "Как тебя зовут, путник?\n")
print(f"Приветствую тебя {name}\n путники тут оказываются не случайно\n Тебе предстоит совершить подвиг \nИ постараться выбраться живым \nУдачи тебе {name}")
health = float(input("Уже уходя, фигура в капюшоне говорит:\n"
                   " - Обрати внимание, у тебя здесь есть ограниченное здоровье.\n"
                   "Ты осматриваешь себя и видишь очки здоровья\n"
                   "Их у тебя ровно: "))
strength = int(input("Фигура уже скрылась за поворотом\n"
                    "А ты все еще осматриваешь себя\n"
                    "и замечаешь что у тебя есть еще и характеристика\n"
                    "Похоже это уровень твоей силы: "))
print(f"Персонаж {name} создан! Здоровье: {health}. Сила: {strength}")
print(type(name),
      type(health),
      type(strength))

print ("Ты отправляешься дальше и встречаешь первого врага.\n"
       "Понятно, что это враг. Он сморит на тебя зловеще.\n"
       "Еще мгновение и вот он уже бросился на тебя\n"
       "Его когти проходят в миллиметре от твоей шеи и рвут твой шарф\n")
