name = input("Ты просыпаешься в темной пещере.\n"
             "Навстречу, из темноты, приближается темный силуэт.\n"
             "Фигура в плаще с капюшоном, закрывающим лицо, спрашивает:\n"
             "Как тебя зовут, путник?\n")
print(f"Приветствую тебя {name}\n путники тут оказываются не случайно\n Тебе предстоит совершить подвиг \nИ постараться выбраться живым \nУдачи тебе {name}")
health = float(input("Уже уходя, фигура в капюшоне говорит:\n"
                   " - Обрати внимание, у тебя здесь есть ограниченное здоровье.\n"
                   "Ты осматриваешь себя и видишь очки здоровья\n"
                   "Их у тебя ровно: "))
if health <= 10 :
    print (f"Твое здоровье всего {health}? Ты слишком хрупкий для этого пути. \nБудь предельно осторожен.")
elif 10 < health <= 30:
    print (f"У тебя достаточно здоровья для этого пути.")
else:
    print (f"Ты обладаешь крепким здоровьем. Это поможет тебе в пути.")
strength = int(input("Фигура уже скрылась за поворотом\n"
                    "А ты все еще осматриваешь себя\n"
                    "и замечаешь что у тебя есть еще и характеристика\n"
                    "Похоже это уровень твоей силы: "))
if strength < 10:
    print ("За стенами раздается громкий смех. Таких слабаков еще поискать")
elif 10 <= strength <= 30:
    print ("Вокруг сохраняется зловещая тишина")
else:
    print ("Со всех сторон доносится звук открывающихся дверей")
if health > 30 and strength > 30:
    print ("Ты слышишь шевеления и скрежет вокруг. \nПохоже твои здоровье и сила привлекли дополнительных врагов.")
print(f"Персонаж {name} создан! Здоровье: {health}. Сила: {strength}")
print(type(name),type(health),type(strength))
